Revit 2027 API
LanguageType Enumeration
 An enumerated type containing the supported Revit product languages.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LanguageType
Public Enumeration LanguageType
public enum class LanguageType
type LanguageType
Members
Member name | Value | Description
Brazilian_Portuguese | 14 |  Brazilian Portuguese.
Chinese_Simplified | 6 |  Chinese simplified.
Chinese_Traditional | 7 |  Chinese traditional.
Czech | 11 |  Czech.
Dutch | 5 |  Dutch.
English_GB | 15 |  English - United Kingdom.
English_USA | 0 |  English USA.
French | 3 |  French.
German | 1 |  German.
Hungarian | 13 |  Hungarian.
Italian | 4 |  Italian.
Japanese | 8 |  Japanese.
Korean | 9 |  Korean.
Polish | 12 |  Polish.
Russian | 10 |  Russian.
Spanish | 2 |  Spanish.
Unknown | -1 |  Unknown.
See Also
Reference
Autodesk.Revit.ApplicationServices Namespace